{
  "entries": [
    {
      "id": "YNtb0mPRdfNoONZ9kP90",
      "title": "Minicraft+ 2.1.0",
      "version": "minicraftplus_2.1.0",
      "image": "https://gitlab.com/KalmeMarq/minicraft-index/-/raw/main/images/minicraftplus.png",
      "body": "<p>This is the release of version 2.1.0. It has been in development for over five months, and has now been released.</p><p>This version adds new features such as a achievement system, decorative tiles, totems, and a resource pack system. Furthermore, this version adds a lot of minor features, and an even larger amount of bugfixes and QoL additions. Changes to the skin system have been made, to make it more stable, and changing the style of the menus for resource packs, skins, and achievements.</p><p>This release also introduces some new recurring contributors: @lino-levan and @BenCheung0422; and we see the return of @Litorom and @TheBigEye. In addition to this, we see some fixes by @alice39, @PseudoDistant, @Sissiogamer1, and @rockedsocks.</p><h2>Additions</h2><ul> <li>Added achievements</li><li>Added ability to copy, cut, and paste in menus</li><li>Added credits menu</li><li>Added the ability to use some ascii characters in world seed</li><li>Added ornate obsidian and ornate stone tiles</li><li>Added raw obsidian and stone tiles</li><li>Added a totem that will spawn the air wizard</li><li>Added resource packs</li><li>Added sound when harvesting plants</li><li>Re-added sparks</li><li>Re-added damage particles</li><li>Re-added item shadows</li><li>Re-added swimming animation</li><li>Re-added colored spawners</li></ul><h2>Changes</h2><ul> <li>Made gem tools purple</li><li>Prevented animals and mobs from de-spawning while in view</li><li>Prevented furniture from being pushed over stair tiles</li><li>Shear loses durability when used on sheep</li><li>The world list should now update if copying or renaming worlds in-game</li><li>Resource packs and skins menu now use the standardised menu look</li><li>Pre-releases are now ignored from version check</li><li>Renamed shear to shears</li><li>Saplings should no longer grow if an entity is on it</li><li>Made cloud cactus into an ore you can mine and use</li></ul><h2>Removed</h2><ul> <li>Removed texture packs</li><li>Removed suits</li><li>Removed second air wizard</li></ul><h2>Bug Fixes</h2><ul> <li>Fixed crash when inputting certain characters into the inventory searcher</li><li>Fixed crash when deleting world</li><li>Fixed rendering of stair tiles in sky level</li><li>Fixed rendering of cloud cactus in sky level</li><li>Fixed time rendering for potions not following m:ss format</li><li>Fixed some hits not hitting properly (0 attack damage)</li></ul>"
    },
    {
      "id": "4WkXdxFc18BlK3gEC1k7",
      "title": "Minicraft+ 2.0.7",
      "version": "minicraftplus_2.0.7",
      "image": "https://gitlab.com/KalmeMarq/minicraft-index/-/raw/main/images/minicraftplus.png",
      "body": "<h2>Added</h2><ul><li>Added sheep shearing</li><li>Added shear tool</li><li>Added potatoes</li><li>Added baked potatoes as food</li><li>Added inventory searcher (F to toggle and Next/Back Page to seek)</li><li>Added fullscreen mode (default key F11)</li><li>Added Indonesian localization</li><li>Added Hungarian localization</li><li>Added SRV record support; service name is _minicraft (only accessible through code)</li><li>Added aggregate analytics for various game states and actions</li><li>Added new skin system with custom skin support</li><li>Added built-in contest winners' skins into skins menu</li></ul><h2>Changed</h2><ul><li>Made zombies drop potatoes</li><li>Sparks (the airwizard bullets) have been optimized</li><li></li><li>Made crops grow slower</li><li>Updated some textures; made wood, apples and gold apples look better</li><li>Made sheep drop beef</li><li>Picking up furniture no longer requires stamina</li><li>You can only use axes on walls, wood doors and wood floor</li><li>Shears must be used to destroy wool tiles</li><li>Disabled multiplayer functionality</li></ul><h2>Fixed</h2><ul><li>Fixed pickup dungeon chests</li><li>Farm tiles will no longer be destroyed if an item is dropped onto it</li><li>Mobs no longer target and attack you when you are in creative mode</li><li>Fixed sound not playing on certain actions</li></ul>"
    },
    {
      "id": "tap8Y07g9xbc0EkFGNLz",
      "title": "Minicraft+ 2.0.6",
      "version": "minicraftplus_2.0.6",
      "image": "https://gitlab.com/KalmeMarq/minicraft-index/-/raw/main/images/minicraftplus.png",
      "body": "<h2>Added</h2><ul><li>Added French localization</li><li>Added more buildings, including abandoned villages</li><li>Added paths, use a pickaxe on grass to make them</li></ul><h2>Changed</h2><ul><li>Prevented players from getting stuck in skyholes with cool animation</li><li>Made the quick-save key configurable</li><li>Let you place floors on clouds</li><li>Water and lava now form obsidian, and don't look like sand when they are next to each other</li><li>Totally overhauled fishing!</li><li>You can now craft obsidian walls and doors</li><li>Resource packs are now possible! Guide is on the wiki</li><li>Creepers have been buffed</li><li>TNT can't break hard rock or obsidian walls</li><li>Menus that don't have frames don't render the title background</li></ul><h2>Fixed</h2><ul><li>Fixed the creeper explosion to only hurt mobs if it actually explodes</li><li>Fixed small line in the snake sprite that shouldn't be there</li><li>Knights and snakes only have 4 levels instead of 5</li><li>Villages and spawner can no logger override stair barriers (to the sky or the dungeon)</li></ul>"
    },
    {
      "id": "Zyj2QVIHaFKLW4lTf29x",
      "title": "Minicraft+ 2.0.5",
      "version": "minicraftplus_2.0.5",
      "image": "https://gitlab.com/KalmeMarq/minicraft-index/-/raw/main/images/minicraftplus.png",
      "body": "<h2>Added</h2><ul><li>Added tool durability to all tools</li><li>Added window popup to display errors</li><li>Added Spanish localization</li><li>Added escape potion, which brings you one level closer to the surface from where it's used</li><li>Added an indicator to tell you what tile in item will be placed on</li></ul><h2>Changed</h2><ul><li>Updated door sprites and a couple others in minor ways</li><li>Allowed creative player to walk outside cloud tiles in the sky</li><li>Made hoe turn grass into dirt instead of straight to farmland; but with significantly higher chance of seeds</li><li>Made some adjustments to some of the sprites for improved detail</li><li>Made flowers spread grass to dirt like grass spreads to dirt, since a flower tile is technically grass too</li><li>Separated directional input into movement and cursor, for player movement and menu selection respectively</li><li>Made sand behave like dirt when being placed</li><li>Made items face the right way when you attack with them</li></ul><h2>Fixed</h2><ul><li>Fixed a couple more multiplayer bugs; also, as of dev6, players should stop crashing when changing levels</li><li>Fixed some localization bugs</li><li>Fixed bug with item crafting and reference</li><li>Fixed bug with dungeon chests refilling on load</li><li>Fixed bug with \"Click to focus\" text rendering</li><li>Fixed bug with armor loading</li><li>Fixed the wheat tile background</li><li>Fixed bug where creative player couldn't break a tile</li><li>Fixed item data in chests</li></ul>"
    },
    {
      "id": "cpvEiL8mL3MWKnzlbcfJ",
      "title": "Minicraft+ 2.0.4",
      "version": "minicraftplus_2.0.4",
      "image": "https://gitlab.com/KalmeMarq/minicraft-index/-/raw/main/images/minicraftplus.png",
      "body": "<h2>Added</h2><ul><li>Added world seeding! You now have a reliable way of recreating a world... provided you used a seed in the first place, that is... Commands aren't quit here yet...</li><li>Added a splash screen! So it's pretty while it's loading.</li><li>Added an official logo! Curtesy of contributors on our discord server.</li><li>Added a new sprite for the log, so it will stop getting confused with planks.</li><li>Added/fixed the hints that pop up when you try to place walls/floors/doors.</li><li>Added an in-game, in-depth storyline guide.</li><li>Added an FPS slider.</li><li>Added keys being dropped back into the game... because apparently that feature disappeared somewhere.</li><li>Added player hunger to world save.</li><li>Added a version checker, so you know when new updates are available without having to look. It even opens the link for you. ;)</li></ul><h2>Changed</h2><ul><li>HUGE menu renovation! Menus will be changed forever. You'll see. It's pretty obvious</li><li>Made default game mode Normal instead of Easy.</li><li>Redid and fixed death chests; they now display time left above the chest, and you \"pickup\" everything in the chest by touching it. It also flashes red when there are 20 seconds before disappearing.</li><li>Changed beds in multiplayer, so that all players must be sleeping before the game speeds up.</li></ul><h2>Removed</h2><ul><li>Removed the \"home\" functionality.</li></ul><h2>Fixed</h2><ul><li>Fixed multiplayer bug where you could only deal 1 damage to things</li><li>Fixed a long-standing bug that mainly affected dungeon chests and airwizards not appearing when they should, as well as mob spawner dungeons</li><li>Fixed score mode in multiplayer</li></ul>"
    },
    {
      "id": "tOpUSXSlOcj1P7tm08ad",
      "title": "Minicraft+ 2.0.3",
      "version": "minicraftplus_2.0.3",
      "image": "https://gitlab.com/KalmeMarq/minicraft-index/-/raw/main/images/minicraftplus.png",
      "body": "<h2>Added</h2><ul><li>Added support for dedicated servers! With a CLI OS, meaning an OS without a GUI. This allows for more compatibility, not to mention more resources being able to be devoted to the game.</li><li>Added various server options, and a command help system, for dedicated servers.</li><li>Added feature to save the last ip address you entered when trying to join a multiplayer server</li><li>Added more error messages when connecting</li><li>Added the ability to drop an item to the ground with Q and shift-Q (shift-q drops the whole stack)</li><li>Created an account system! you must now register on the playminicraft site to use multiplayer. Comes with offline mode.</li><li>Added an fps limiter</li><li>Added back and fixed knockbacks, after removing them since they didn't work how I wanted.</li></ul><h2>Changed</h2><ul><li>Made it so you can transfer single items to and from chests, with the drop key.</li><li>Made various optimizations to the code</li><li>Allowed torches to be placed on obsidian bricks</li></ul><h2>Fixed</h2><ul><li>Fixed item entity spawn positions and going through other tiles</li><li>Fixed bugs with creative inventory, so it always has all items.</li><li>Fixed issues with the pickup control in single player and multiplayer</li><li>Fixed multiplayer client saving with the account system.</li></ul>"
    },
    {
      "id": "gGdjKxEvJl6wwjsdJcEv",
      "title": "Minicraft+ 2.0.2",
      "version": "minicraftplus_2.0.2",
      "image": "https://gitlab.com/KalmeMarq/minicraft-index/-/raw/main/images/minicraftplus.png",
      "body": "<h2>Added</h2><ul><li>Added \"unknown\" item to make it obvious when something has gone wrong; it has the requested name, but the sprite is a pink square.</li><li>Added F3 menu for the server instance of the game in multiplayer.</li></ul><h2>Changed</h2><ul><li>Switched the multiplayer protocol from UDP to TCP.</li><li>Made TNT light other TNT</li><li>Edited coal drop amount</li><li>Made lots of edits to mob spawn rate, and mob count management</li><li>Made it so all mobs (not players obviously) despawn after a certain amount of time (will later be fixed so mobs close to the player don't despawn.</li><li>Made enchanter craftable.</li></ul><h2>Fixed</h2><ul><li>Fixed problems with doors, floors, and walls (item drops, etc.)</li><li>Fixed multiplayer attack rendering across clients; now shows attack, including the item a client is attacking with.</li><li>Fixed creative inventory for clients in multiplayer.</li><li>Fixed multiplayer client saving.</li><li>Fixed unlocked score mode times not appearing until you restarted the game; you shouldn't have to restart it now.</li><li>Patched possible duplicate usernames glitch</li></ul><h2>Removed</h2><ul><li>Removed enchanter and workbench from starting inventory.</li><li>Removed the power glove. It's still used, but you can only use it by pressing the \"pickup\" key (\"v\" by default); you can't get it in your inventory.</li><li>Removed all the \"frozen mobs\" which kept appearing in multiplayer</li></ul>"
    },
    {
      "id": "l17t62ObrVaXIW7yMAI0",
      "title": "Minicraft+ 2.0.1",
      "version": "minicraftplus_2.0.1",
      "image": "https://gitlab.com/KalmeMarq/minicraft-index/-/raw/main/images/minicraftplus.png",
      "body": "<h2>Added</h2><ul><li>Added more super-secret debug powers... mua ha ha...</li><li>Added to F3 window: level mobcount + max mobcount, and name of current tile</li><li>Added multiplayer feature: when hosting a server, a new window opens up for you to play as any other player, though your settings will be saved so that your should be able to continue as normal if you load the world as single player again. The server window lets you view the players connected, and change world difficulty and such.</li><li>Added multiplayer feature: the inventory and such data for people connected to the server is saved in a seperate file along with the computer's MAC address, so if they connect with that computer again, their inventory and stats should be restored.</li></ul><h2>Changed</h2><ul><li>This version should be compatible with 1.8 save files.</li><li>Edited the mob spawning algorithm, so mobs should not spawn at such a crazy speed as before</li><li>Renovated Multiplayer! It should now be much less laggy. Still not quite tolerable, but... better.</li><li>Ensured that most all the normal world features work in multiplayer. However, I have not been able to do much testing with Client Player saves, so that might not work very well. Everything else should work, though; but the connection lag between computers may cause some wierd effects. Fixing this lag is my next goal.</li></ul><h2>Fixed</h2><ul><li>Arrows now appear in your inventory</li><li>Fixed crafting; correct number of items are used</li><li>Creepers shouldn't be able to blow up stairs anymore</li><li>Bed spawning should now work; once you sleep in a bed, you will always spawn from the place that you were standing right before you got in bed, unless that spot later becomes rock, or something else a player can't walk through. The bed does not have to remain where it is; you can destroy it, and you will continue to spawn in the spot described above.</li><li>Fixed Save folder for non-windows users. You may notice a strange folder called \"null\" in the same folder as the minicraft jar. Move the \".playminicraft\" folder inside to your home directory, and it should recognize it again. It may be hidden due to the  \".\"</li></ul>"
    },
    {
      "id": "PnlbKFjEXRSz8ubjqpdo",
      "title": "Minicraft+ 2.0.0",
      "version": "minicraftplus_2.0.0",
      "image": "https://gitlab.com/KalmeMarq/minicraft-index/-/raw/main/images/minicraftplus.png",
      "body": "<h2>Added</h2><ul><li>MULTIPLAYER MODE now supported! (dun, dun-dun-dun!)</li><ul><li>Well... kind of. I got one way to work, but it's super laggy.</li></ul></ul><h2>Fixed</h2><ul><li>You disappear from the level when you get in bed, as you should</li><li>you can now see the edges of the level</li><li>Crafting furniture no longer disappears upon loading a pre-existing world</li><li>Stackable item count decreases as it should</li></ul>"
    },
    {
      "id": "xJ5asIdNuTxOuIsMPW9u",
      "title": "Minicraft+ 1.9.4",
      "version": "minicraftplus_1.9.4",
      "image": "https://gitlab.com/KalmeMarq/minicraft-index/-/raw/main/images/minicraftplus.png",
      "body": "<h2>Added</h2><ul><li>Daylight now increases and decreases more smoothly; steadily goes from dark to light in the morning, and light to dark in the evening.</li><li>Added Instant Health Potion! Instantly refills up to 5 hearts.</li><li>Added missingTexture sprite.</li><li>Added some more help messages when trying do things that you might not know you can't do yet. (destroying hardrock, obsidian stair on lava level).</li><li>Added small tweak for creative mode: empty buckets will remain empty, so you can empty the ocean as much as you like. Full buckets remain full, as well.</li><li>You can now copy world saves.</li><li>Added another confirm dialog before deleting worlds.</li><li>Player score shown on-screen in score mode. TIP: as you probably don't know... you can unlock new time limits for score mode. unlock 10min by getting 1000 points in a 20min game, and unlock 2Hour by getting 100,000 points in a 1Hour game. (Hint: defeating the AirWizard gives you 100,000 points...)</li></ul><h2>Changes</h2><ul><li>Almost total revision of lighting; surface level now has lighting overlay sometimes, and the colors all around may be slightly different.</li><li>Changed death chest expire times; easy: 30min, norm: 10min, hard: 2min</li><li>Speed up sleeping game speed.</li><li>Prevented Airwizard from being removed during daily entity clear.</li><li>Increased Torch light radius; also, torches now work the same way on the surface as they do in the caves.</li><li>Changed the name of a couple items (was abbreviated).</li><li>Wool slows down all mobs except you.</li><li>Imposed a limit to the number of mobs that can spawn on a level, dependent on the level and the game difficulty.</li><li>Additional creative mode tweak: \"attacking\" mob spawner with hand changes the level of mob it spawns. Also, you can pick up spawners in creative mode.</li><li>Creative mode inventory remains full.</li><li>Key controls displayed on (hopefully) all menus will always be correct. ;)</li><li>Revised some key binding details to hopefully prevent inability to select anything. Also, added feature to reset all key bindings to default.</li></ul>"
    },
    {
      "id": "YgDp1qHheIiiiY9Qe2sP",
      "title": "Minicraft+ 1.9.3",
      "version": "minicraftplus_1.9.3",
      "image": "https://gitlab.com/KalmeMarq/minicraft-index/-/raw/main/images/minicraftplus.png",
      "body": "<h2>Added</h2><ul><li>Added command line argument to change the save directory of the world files.</li><li>Added back feature where mobs stay away during the first night.</li><li>Loading has a progress bar. Though honestly, it doesn't need one.</li></ul><h2>Changes</h2><ul><li>Revised input system to (hopefully) work on any language keyboard/computer.</li><li>Reduced world load time from 2 seconds to about half a second, for me). It used to generate new levels needlessly, but now it doesn't.</li></ul>"
    },
    {
      "id": "hZOTsXg9oRtxKTMA7mYw",
      "title": "Minicraft+ 1.9.2",
      "version": "minicraftplus_1.9.2",
      "image": "https://gitlab.com/KalmeMarq/minicraft-index/-/raw/main/images/minicraftplus.png",
      "body": "<h2>Added</h2><ul><li>Added Key Binding Menu, finally! You can now customize key controls, and save them. Accessible from the title screen, and the pause menu.</li><li>Added spanish keyboard(/computer?) support... for the enter (and backspace) key... but that's all you need to access and change the key binding menu.</li><li>world difficulty is saved for each world</li></ul><h2>Changes</h2><ul><li>Key bindings, sound, and autosave options are loaded on startup, in a special file that applies to all saves; like beating the second airwizard.</li><li>renovated entities</li><li>renovated menus, a bit</li><li>HUGE renovations to the code; might not see many changes to functionality, but entirely new bugs are bound to crop up...</li></ul>"
    },
    {
      "id": "Oz278vddomjYNQOalsGD",
      "title": "Minicraft+ 1.9.1",
      "version": "minicraftplus_1.9.1",
      "image": "https://gitlab.com/KalmeMarq/minicraft-index/-/raw/main/images/minicraftplus.png",
      "body": "<h2>Changes</h2><ul><li>Armor now functions as a damage buffer rather than extra hearts; you take damage after only a certain number of damage points accumulate.</li><li>Armor lasts longer.</li><li>Rate of hunger bar healing health depends on hunger; still happens when less than full health.</li><li>Added version number to save file</li><li>Hunger bar now decreases in a better way (in my opinion)</li><li>Fixed all the bugs I could find!</li></ul><h2>Removed</h2><ul><li>Removed player's restriction on movement while being hurt</li></ul>"
    },
    {
      "id": "Ssm7nz1BiiGeqdu2AzYW",
      "title": "Minicraft+ 1.9",
      "version": "minicraftplus_1.9",
      "image": "https://gitlab.com/KalmeMarq/minicraft-index/-/raw/main/images/minicraftplus.png",
      "body": "<h2>Added</h2><ul><li>Game window is resizable</li><li>Added debug features</li><li>More entries in debug display</li><li>Key preferences... well, kinda. You can't really change them...</li><li>Modifier keys supported (shift, alt, ctrl)</li><li>Added obsidian brick and door to creative inventory</li></ul><h2>Changes</h2><ul><li>Airwizard suit status and key prefs saved with game file</li></ul>"
    },
    {
      "id": "tnvZY8OXtkFtPFuslJXJ",
      "title": "Minicraft+ 1.8",
      "version": "minicraftplus_1.8",
      "image": "https://gitlab.com/KalmeMarq/minicraft-index/-/raw/main/images/minicraftplus.png",
      "body": "<h2>Added</h2><ul><li>Spawners & underground mini-dungeons</li><li>Added colored clothes to change the player's outfit. They are craftable in the loom, or dropped rarely by zombies.</li><li>You can set the timer for score mode: 20m (default), 30m, 40m, or 1h</li><li>You can unlock new score mode times with high enough scores: 10 min and 2 hours.</li><li>\"Airwizard II\" boss shows up on the surface after you unlock all the locked chests</li><li>Once you defeat the Air Wizard, you can wear his costume by going into the settings menu. This suit allows the player to walk on air tiles.</li></ul><h2>Changes</h2><ul><li>Airwizard's health appears above his head</li></ul>"
    },
    {
      "id": "XleLB7SW7cNtcqzBlFzV",
      "title": "Minicraft+ 1.7",
      "version": "minicraftplus_1.7",
      "image": "https://gitlab.com/KalmeMarq/minicraft-index/-/raw/main/images/minicraftplus.png",
      "body": "<h2>Added</h2><ul><li>Save/Load words</li><li>Potions</li><li>Added locked chests in purple dungeon</li><li>Added an Iron Lantern at the entrance of the purple dungeon</li><li>Keys to open the chests are dropped by knights</li></ul><h2>Changes</h2><ul><li>Updated pause menu</li><li>A death chest will appear if you die, allowing you to retrieve your stuff.</li></ul>"
    }
  ]
}